// Цветовая схема для аминокислот
export const AMINO_ACID_COLORS: Record<string, string> = {
  A: '#FFD700', // Желтый
  R: '#0000FF', // Синий
  N: '#00FF00', // Зеленый
  D: '#FF0000', // Красный
  C: '#FFFF00', // Ярко-желтый
  E: '#FF4500', // Оранжево-красный
  Q: '#00FFFF', // Голубой
  G: '#808080', // Серый
  H: '#800080', // Пурпурный
  I: '#008000', // Темно-зеленый
  L: '#32CD32', // Лаймовый
  K: '#00008B', // Темно-синий
  M: '#8B4513', // Коричневый
  F: '#4B0082', // Индиго
  P: '#FF69B4', // Розовый
  S: '#00FA9A', // Морская волна
  T: '#7CFC00', // Зелено-желтый
  W: '#800000', // Темно-красный
  Y: '#DA70D6', // Орхидея
  V: '#006400', // Темно-зеленый
  '-': 'transparent',
};
